In [1]:
%autosave 0

Autosave disabled

In [2]:
import os

import pandas as pd

from env import get_connection

We can read data from a google sheet using a little formatting and pd.read_csv.

In [3]:
url = 'https://docs.google.com/spreadsheets/d/1_9HqVfodBuR6rJfVb4d36zDesEv4O9GwPI3M7MgX7So/edit?usp=sharing'

export_url = url.replace('/edit?usp=sharing', '/export?format=csv')

pd.read_csv(export_url)

,Movie Title,Release Date,Year,Month,Weekday,Months_since_release,Wikipedia URL,Genre (1),Genre (2),Director (1),...,Budget ($),Box Office Revenue ($),Profit,Is_blockbuster,Comedy_Blockbuster,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,The Devil Inside,1/6/2012,2012,1,6,139,https://en.wikipedia.org/wiki/The_Devil_Inside...,Horror,Drama,William Brent Bell,...,"$1,000,000","$101,800,000","$100,800,000",Is_Blockbuster,FALSE,NaN,NaN,NaN,NaN,NaN
1,Red Tails,1/20/2012,2012,1,6,139,https://en.wikipedia.org/wiki/Red_Tails,Drama,NaN,Anthony Hemingway,...,"$58,000,000","$50,400,000","-$7,600,000",FALSE,FALSE,NaN,NaN,NaN,NaN,NaN
2,Declaration of War,1/27/2012,2012,1,6,138,https://en.wikipedia.org/wiki/Declaration_of_W...,Romance,Drama,Valérie Donzelli,...,"$1,500,000","$6,500,000","$5,000,000",FALSE,FALSE,NaN,NaN,NaN,NaN,NaN
3,Man on a Ledge,1/27/2012,2012,1,6,138,https://en.wikipedia.org/wiki/Man_on_a_Ledge,Action,Drama,Asger Leth,...,"$42,000,000","$46,200,000","$4,200,000",FALSE,FALSE,Budget Stats,NaN,NaN,NaN,NaN
4,One for the Money,1/27/2012,2012,1,6,138,https://en.wikipedia.org/wiki/One_for_the_Mone...,Crime,Romance,Julie Anne Robinson,...,"$40,000,000","$36,900,000","-$3,100,000",FALSE,FALSE,Sum,"$24,826,670,000",NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
503,Kubo and the Two Strings,8/19/2016,2016,8,6,84,https://en.wikipedia.org/wiki/Kubo_and_the_Two...,Fantasy,NaN,Travis Knight,...,"$60,000,000","$27,600,000","-$32,400,000",FALSE,FALSE,NaN,NaN,NaN,NaN,NaN
504,War Dogs,8/19/2016,2016,8,6,84,https://en.wikipedia.org/wiki/War_Dogs_(2016_f...,Crime,Comedy,Todd Phillips,...,"$40,000,000","$42,700,000","$2,700,000",FALSE,FALSE,NaN,NaN,NaN,NaN,NaN
505,Don't Breathe,8/26/2016,2016,8,6,83,https://en.wikipedia.org/wiki/Don%2527t_Breath...,Thriller,NaN,Fede Alvarez,...,"$9,900,000","$28,300,000","$18,400,000",FALSE,FALSE,NaN,NaN,NaN,NaN,NaN
506,Hands of Stone,8/26/2016,2016,8,6,83,https://en.wikipedia.org/wiki/Hands_of_Stone,Biography,Drama,Jonathan Jakubowicz,...,"$20,000,000","$1,700,000","-$18,300,000",FALSE,FALSE,NaN,NaN,NaN,NaN,NaN
507,Mechanic: Resurrection,8/26/2016,2016,8,6,83,https://en.wikipedia.org/wiki/Mechanic:_Resurr...,Action,NaN,Dennis Gansel,...,"$40,000,000","$7,500,000","-$32,500,000",FALSE,FALSE,NaN,NaN,NaN,NaN,NaN

We can read in an excel file with pd.read_excel.

In [4]:
pd.read_excel('stock_performance.xlsx')

,Unnamed: 0,the weight of the stock-picking concept,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,the original investment performance indicator,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,the normalized investment performance indicator,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,ID,Large B/P,Large ROE,Large S/P,Large Return Rate in the last quarter,Large Market Value,Small systematic Risk,Annual Return,Excess Return,Systematic Risk,Total Risk,Abs. Win Rate,Rel. Win Rate,Annual Return,Excess Return,Systematic Risk,Total Risk,Abs. Win Rate,Rel. Win Rate
1,1,1,0,0,0,0,0,0.019516,0.013399,1.902608,0.218617,0.6,0.4,0.488229,0.609445,0.780756,0.8,0.68,0.333333
2,2,0,1,0,0,0,0,0.023829,0.00641,1.263287,0.12874,0.55,0.65,0.505279,0.508169,0.443776,0.41422,0.56,0.666667
3,3,0,0,1,0,0,0,0.080282,0.026548,1.894339,0.208272,0.55,0.5,0.728484,0.8,0.776397,0.755594,0.56,0.466667
4,4,0,0,0,1,0,0,-0.006683,0.000728,1.425454,0.155526,0.55,0.35,0.38464,0.425836,0.529253,0.529196,0.56,0.266667
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
59,59,0.2,0.2,0.2,0,0.2,0.2,0.034682,0.007396,1.010771,0.100845,0.55,0.65,0.548192,0.522462,0.310677,0.294491,0.56,0.666667
60,60,0.2,0.2,0,0.2,0.2,0.2,0.033733,0.006783,0.918444,0.092028,0.6,0.6,0.544438,0.51357,0.262013,0.256644,0.68,0.6
61,61,0.2,0,0.2,0.2,0.2,0.2,0.044852,0.010413,1.162878,0.118172,0.55,0.5,0.588401,0.566175,0.390852,0.368861,0.56,0.466667
62,62,0,0.2,0.2,0.2,0.2,0.2,0.040456,0.008777,0.998392,0.100601,0.6,0.65,0.571021,0.542471,0.304153,0.293441,0.68,0.666667
63,63,0.167,0.167,0.167,0.167,0.167,0.167,0.05751,0.012866,1.048489,0.10497,0.55,0.75,0.638448,0.601735,0.330558,0.312193,0.56,0.8

We can read the results of a SQL query into a dataframe using pd.read_sql.

In [5]:
db_url = get_connection('chipotle')

query = '''
        SELECT *
        FROM orders
        '''

In [6]:
chip = pd.read_sql(query, db_url)
chip.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

Let's store the results of this SQL query in a csv file!

In [7]:
chip.to_csv('chip.csv', index = 0)

We can read back in our data from the csv file instead of the SQL query.

In [8]:
chip_local = pd.read_csv('chip.csv')
chip_local.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [25]:
# Develop a function for saving in your machine

def get_chip():

    filename = 'chip.csv'

    if os.path.isfile(filename):
    
        print('Found your sauce dawg!')
        
        return pd.read_csv(filename)
        
    else:
        
        print('Retieving da sauce!!!')

        url = get_connection('chipotle')
    
        query = '''
                SELECT *
                FROM orders
                '''
        
        chip = pd.read_sql(query, url)
        chip.to_csv(filename, index = 0)
    
        return chip

In [26]:
first_chip = get_chip()
first_chip.head()

Retieving da sauce!!!

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [27]:
second_chip = get_chip()
second_chip.head()

Found your sauce dawg!

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

Saved the best for last.. let's have some fun with pd.read_clipboard and pd.read_html.

In [28]:
# Use at your own risk!!!
pd.read_clipboard()

,,,,,,Data,about,the,planets,of,our,solar,system,(Planetary,facts,taken,from,Nasa's,Planetary,Fact,Sheet,-,Metric).
Name,Mass,(1024kg),Diameter,(km),Density,(kg/m3),Gravity,(m/s2),Length,of,day,(hours),Distance,from,Sun,(106km),Mean,temperature,(°C),Number,of,moons,Notes
Terrestrial,planets,Mercury,0.330,"4,879",5427,3.7,4222.6,57.9,167,0,Closest,to,the,Sun,None,None,None,None,None,None,None,None,None
Venus,4.87,"12,104",5243,8.9,2802.0,108.2,464,0,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None
Earth,5.97,"12,756",5514,9.8,24.0,149.6,15,1,Our,world,None,None,None,None,None,None,None,None,None,None,None,None,None
Mars,0.642,"6,792",3933,3.7,24.7,227.9,-65,2,The,red,planet,None,None,None,None,None,None,None,None,None,None,None,None
Jovian,planets,Gas,giants,Jupiter,1898,"142,984",1326,23.1,9.9,778.6,-110,67,The,largest,planet,None,None,None,None,None,None,None,None
Saturn,568,"120,536",687,9.0,10.7,1433.5,-140,62,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None
Ice,giants,Uranus,86.8,"51,118",1271,8.7,17.2,2872.5,-195,27,None,None,None,None,None,None,None,None,None,None,None,None,None
Neptune,102,"49,528",1638,11.0,16.1,4495.1,-200,14,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None
Dwarf,planets,Pluto,0.0146,"2,370",2095,0.7,153.3,5906.4,-225,5,Declassified,as,a,planet,in,"2006,",but,this,remains,controversial.,None,None,None

In [29]:
!pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 112.2/112.2 kB 5.5 MB/s eta 0:00:00
Requirement already satisfied: webencodings in /opt/homebrew/anaconda3/lib/python3.10/site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in /opt/homebrew/anaconda3/lib/python3.10/site-packages (from html5lib) (1.16.0)
Installing collected packages: html5lib
Successfully installed html5lib-1.1

In [37]:
# ensure source url is correct for referenced table when using htis method to read in data.

pd.read_html('https://nssdc.gsfc.nasa.gov/planetary/factsheet/')[0]

,0,1,2,3,4,5,6,7,8,9,10
0,NaN,MERCURY,VENUS,EARTH,MOON,MARS,JUPITER,SATURN,URANUS,NEPTUNE,PLUTO
1,Mass (1024kg),0.330,4.87,5.97,0.073,0.642,1898,568,86.8,102,0.0130
2,Diameter (km),4879,12104,12756,3475,6792,142984,120536,51118,49528,2376
3,Density (kg/m3),5429,5243,5514,3340,3934,1326,687,1270,1638,1850
4,Gravity (m/s2),3.7,8.9,9.8,1.6,3.7,23.1,9.0,8.7,11.0,0.7
5,Escape Velocity (km/s),4.3,10.4,11.2,2.4,5.0,59.5,35.5,21.3,23.5,1.3
6,Rotation Period (hours),1407.6,-5832.5,23.9,655.7,24.6,9.9,10.7,-17.2,16.1,-153.3
7,Length of Day (hours),4222.6,2802.0,24.0,708.7,24.7,9.9,10.7,17.2,16.1,153.3
8,Distance from Sun (106 km),57.9,108.2,149.6,0.384*,228.0,778.5,1432.0,2867.0,4515.0,5906.4
9,Perihelion (106 km),46.0,107.5,147.1,0.363*,206.7,740.6,1357.6,2732.7,4471.1,4436.8
10,Aphelion (106 km),69.8,108.9,152.1,0.406*,249.3,816.4,1506.5,3001.4,4558.9,7375.9
11,Orbital Period (days),88.0,224.7,365.2,27.3*,687.0,4331,10747,30589,59800,90560
12,Orbital Velocity (km/s),47.4,35.0,29.8,1.0*,24.1,13.1,9.7,6.8,5.4,4.7
13,Orbital Inclination (degrees),7.0,3.4,0.0,5.1,1.8,1.3,2.5,0.8,1.8,17.2
14,Orbital Eccentricity,0.206,0.007,0.017,0.055,0.094,0.049,0.052,0.047,0.010,0.244
15,Obliquity to Orbit (degrees),0.034,177.4,23.4,6.7,25.2,3.1,26.7,97.8,28.3,122.5
16,Mean Temperature (C),167,464,15,-20,-65,-110,-140,-195,-200,-225
17,Surface Pressure (bars),0,92,1,0,0.01,Unknown*,Unknown*,Unknown*,Unknown*,0.00001
18,Number of Moons,0,0,1,0,2,92,83,27,14,5
19,Ring System?,No,No,No,No,No,Yes,Yes,Yes,Yes,No
20,Global Magnetic Field?,Yes,No,Yes,No,No,Yes,Yes,Yes,Yes,Unknown
21,NaN,MERCURY,VENUS,EARTH,MOON,MARS,JUPITER,SATURN,URANUS,NEPTUNE,PLUTO